{
    "intents": [
      {
        "tag": "greeting",
        "patterns": ["Hello", "Hi", "Hey", "Hi there", "Greetings", "What's up"],
        "responses": ["Hello! How can I assist you today?", "Hi there! How can I help you?", "Hey! What can I do for you today?"]
      },
      {
        "tag": "about_chatbot",
        "patterns": [
            "What is your full name?",
            "Can you tell me your name?",
            "What is your complete name?",
            "What should I call you?",
            "May I know your name?"
        ],
        "responses": [
            "My name is Chatbot, and I'm here to assist you with your income tax related queries."
        ]
    },
      {
        "tag": "personal_info",
        "patterns": ["What personal information do I need to file my income tax?", 
                      "What are the details I need to provide to file my income tax?", 
                      "What documents are required to file my income tax?", 
                      "What personal details are needed to file my income tax?"],
        "responses": ["To file your income tax, you need to provide your PAN (Permanent Account Number), Aadhaar number, bank account details, and details of your income and investments."]
      },
      {
        "tag": "income_sources",
        "patterns": ["What are the different sources of income that are taxable?", 
                      "What types of income are subject to tax?", 
                      "What are the taxable sources of income?", 
                      "Which types of income are taxed in India?"],
        "responses": ["The different sources of income that are taxable include salary income, income from business or profession, rental income, capital gains, and income from other sources such as interest on savings accounts and fixed deposits."]
      },
      {
        "tag": "tax_slabs",
        "patterns": ["What are the different tax slabs for individuals?", 
                      "What is the income tax rate for different income slabs?", 
                      "What are the tax rates for different income groups?", 
                      "What are the tax brackets for individuals?"],
        "responses": ["The income tax slabs for individuals are: - Up to Rs. 2.5 lakh: No tax. - Rs. 2.5 lakh to Rs. 5 lakh: 5%. - Rs. 5 lakh to Rs. 7.5 lakh: 10%. - Rs. 7.5 lakh to Rs. 10 lakh: 15%. - Rs. 10 lakh to Rs. 12.5 lakh: 20%. - Rs. 12.5 lakh to Rs. 15 lakh: 25%. - Above Rs. 15 lakh: 30%"]
      },
      {
        "tag": "deductions",
        "patterns": ["What are the deductions available under income tax?", 
                      "What are the tax exemptions and deductions that are allowed?", 
                      "Which are the tax deductions available for individuals?", 
                      "What are the tax-saving options available under income tax?"],
        "responses": ["Some of the popular deductions available under income tax include: - Section 80C: Investment in tax-saving instruments such as PPF, NSC, ELSS, etc. - Section 80D: Payment of medical insurance premium.  - Section 80E: Payment of interest on education loan. - Section 24: Interest paid on home loan"]
      },
      {
        "tag": "gst_overview",
        "patterns": [
            "What is GST?",
            "Can you tell me about GST?",
            "What is the full form of GST?",
            "What are the benefits of GST?",
            "How does GST work?"
        ],
        "responses": [
            "GST stands for Goods and Services Tax. It is a value-added tax that is levied on most goods and services sold for domestic consumption. GST is charged at every stage of the supply chain, but it is ultimately borne by the end consumer. The GST system helps in eliminating the cascading effect of taxes and promoting the growth of the economy."
        ]
    },
    {
        "tag": "gst_registration",
        "patterns": [
            "Do I need to register for GST?",
            "How can I register for GST?",
            "What is the GST registration process?",
            "What are the documents required for GST registration?",
            "Can you help me with my GST registration?"
        ],
        "responses": [
            "If your annual turnover exceeds Rs. 20 lakhs (Rs. 10 lakhs for special category states), you are required to register for GST. The GST registration process involves submitting an online application on the GST portal and providing various documents, such as PAN card, Aadhaar card, bank statement, and proof of business registration. You can also seek the help of a GST practitioner for assistance with your registration."
        ]
    },
    {
        "tag": "gst_returns",
        "patterns": [
            "What are GST returns?",
            "How do I file my GST returns?",
            "What is the due date for filing GST returns?",
            "What happens if I don't file my GST returns on time?",
            "Can you explain the different types of GST returns?"
        ],
        "responses": [
            "GST returns are the tax forms that are used to report your business's sales and purchases and the amount of GST you have paid and collected during a given period. GST returns need to be filed online on the GST portal by the due date, which is usually the 20th of the following month. If you don't file your GST returns on time, you may be subject to penalties and interest. There are various types of GST returns, such as GSTR-1, GSTR-3B, and GSTR-9, each of which has its own frequency and due date."
        ]
    },
    {
        "tag": "gst_invoicing",
        "patterns": [
            "What are the rules for GST invoicing?",
            "What information should be included in a GST invoice?",
            "Can you give me an example of a GST invoice?",
            "How can I generate a GST invoice?",
            "What are the consequences of not issuing a GST invoice?"
        ],
        "responses": [
            "GST invoicing rules require that a GST-compliant invoice should contain various details, such as the supplier's name and address, the recipient's name and address, the invoice date, the invoice number, a description of the goods or services supplied, the quantity and unit of measure, the taxable value, and the GST rate and amount. You can generate a GST invoice using various accounting software or by using templates available on the GST portal. Not issuing a GST invoice or issuing an incorrect invoice can result in penalties and interest."
        ]
    },
    {
        "tag": "gst_rates",
        "patterns": [
            "What are the GST rates for different goods and services?",
            "Can you tell me about the GST rates for different products?",
            "What is the GST percentage for different categories of goods and services?",
            "How much GST do I need to pay for different products and services?",
            "What is the GST slab for different items?",
            "What are the tax rates for various goods and services under GST?",
            "Can you provide me the list of GST rates for different commodities?"
        ],
        "responses": [
            "The GST rates for goods and services are as follows:\n\n- 0%: Exempted goods and services\n- 5%: Essential goods such as food items, footwear, etc.\n- 12%: Commonly used items such as mobile phones, computers, etc.\n- 18%: Household goods such as furniture, lamps, etc.\n- 28%: Luxury items such as cars, tobacco products, etc.\n\nNote that some goods and services may be taxed at a different rate under special circumstances."
        ]
    }
    ]
}
  